Revit 2024 API
ElectricalSystemType Enumeration
 An enumerated type listing all the possible electrical system types for a connector object.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum ElectricalSystemType
Visual Basic
Public Enumeration ElectricalSystemType
Visual C++
public enum class ElectricalSystemType
Members
Member name | Description
UndefinedSystemType |  Undefined system type
Data |  Electrical System Type is Data.
PowerCircuit |  Electrical System Type is PowerCircuit.
Telephone |  Electrical System Type is Telephone.
Security |  Electrical System Type is Security
FireAlarm |  Electrical System Type is FireAlarm
NurseCall |  System Type is NurseCall.
Controls |  Electrical System Type is Controls.
Communication |  Electrical System Type is Communication.
PowerBalanced |  Electrical System Type is PowerBalanced.
PowerUnBalanced |  Electrical System Type is PowerUnBalanced.
See Also
Autodesk.Revit.DB.Electrical Namespace